docs/research/PROPAGATOR_NETWORKS.tex
\subsection{"The Art of the Propagator" (2009)}
\label{sec:org524c90e}

Radul and Sussman published a companion paper, "The Art of the
Propagator" \footnote{Radul, A. \& Sussman, G.J. (2009). "The Art of the
Propagator." MIT-CSAIL-TR-2009-002.}, presenting the model more concisely. The
paper emphasizes that the model "makes it easy to smoothly combine
expression-oriented and constraint-based programming, and easily
accommodates implicit incremental distributed search in ordinary
programs."
\subsection{The Revised Report (2010)}
\label{sec:org427cf9c}

Radul and Sussman published the "Revised Report on the Propagator Model"
\subsection{Software Design for Flexibility (2021)}
\label{sec:orgd35cf7c}

Chris Hanson and Sussman's book \emph{Software Design for Flexibility}
\section{Core Concepts}
\label{sec:org7d03620}

\subsection{Cells}
\label{sec:org56cd361}

A \textbf{cell} is the stateful storage element of a propagator network. Unlike
a variable in traditional programming (which holds a single definitive
value and can be overwritten), a cell \emph{accumulates information about a
value}. A cell supports three operations:

\begin{enumerate}
\item \textbf{Add content}: New information is \emph{merged} with the cell's existing
information (not overwritten).
\item \textbf{Read content}: Retrieve the current state of accumulated knowledge.
\item \textbf{Register propagators}: Propagators subscribe to the cell and are
notified when its content changes.
\end{enumerate}

The information in a cell ranges from "I know absolutely nothing" (the
special value \texttt{nothing}, or lattice bottom \(\bot\)) to "I know everything
there is to know, and the answer is 42" to the anomalous case "I know
there is a contradiction!" (lattice top \(\top\)).

Critically, information in a cell \emph{never decreases}. A cell can move
from "I don't know" to "it's an integer" to "it's a positive integer" to
"it's 42," but it can never move backward from "it's 42" to "I don't
know." This monotonicity is not merely a convention --- it is the
mathematical foundation ensuring convergence and determinism.
\subsection{Propagators}
\label{sec:orgc1045d1}

A \textbf{propagator} is the computational element of the network. Propagators are:

\begin{itemize}
\item \textbf{Autonomous}: They operate independently, with no central controller
directing their execution.
\item \textbf{Stateless}: They maintain no internal state. All persistent state
resides in cells.
\item \textbf{Asynchronous}: They can fire in any order; the final result is the
same (confluence).
\end{itemize}

A propagator monitors its input cells and, when any input changes,
computes new information and adds it to its output cells. The
computation is always \emph{additive} --- a propagator can only \emph{contribute}
information, never \emph{remove} it.

In practice, a propagator is a function from the current network state to
a (possibly modified) network state: it reads from some cells, computes,
and writes to others via the merge operation. If its contribution adds
no new information (i.e., the merge result is identical to the cell's
existing content), the network state is unchanged and no further
propagation is triggered.
\subsection{The Merge Operation}
\label{sec:orgc826b69}

The merge operation is the heart of the propagator model. When a
propagator writes information \(b\) to a cell already containing
information \(a\), the cell's new content is \(\text{merge}(a, b)\) --- the
combination of both pieces of knowledge.

Merge must satisfy three algebraic laws:

\begin{itemize}
\item \textbf{Commutativity}: \(\text{merge}(a, b) = \text{merge}(b, a)\)
--- the order in which information arrives does not matter.
\item \textbf{Associativity}: \(\text{merge}(\text{merge}(a, b), c) = \text{merge}(a, \text{merge}(b, c))\)
--- grouping does not matter.
\item \textbf{Idempotency}: \(\text{merge}(a, a) = a\)
--- re-contributing the same information has no effect.
\end{itemize}

These three laws make merge a \textbf{join-semilattice} operation (see
\ref{sec:org063aa5a}). The commutativity and associativity
ensure that the final cell state is independent of the order in which
propagators fire. The idempotency ensures that redundant contributions
are harmless. Together, these properties guarantee \textbf{confluence}: the
result of running a propagator network depends only on the initial cell
contents and the set of propagators, not on the order or timing of
execution.

Key behaviors of merge:

\begin{itemize}
\item \(\text{merge}(\bot, x) = x\) --- merging anything with "nothing" yields
that thing (bottom is the identity).
\item \(\text{merge}(x, x) = x\) --- consistent redundant information is
harmless.
\item \(\text{merge}(\top, x) = \top\) --- once a contradiction is reached, it
cannot be undone (top is absorbing).
\item \(\text{merge}(a, b) = \top\) when \(a\) and \(b\) are incompatible ---
contradictory information produces a contradiction.
\end{itemize}
\subsection{Partial Information}
\label{sec:org05317c2}

The propagator model supports a rich hierarchy of partial information types:

\begin{itemize}
\item \textbf{Nothing (\(\bot\))}: Complete ignorance about the value.
\item \textbf{Raw values}: Fully determined information (e.g., the integer 42).
\item \textbf{Intervals}: Bounded ranges (e.g., \([3.0, 5.0]\)), representing the
knowledge that a value lies somewhere within bounds.
\item \textbf{Finite domains}: Sets of possible values (e.g., \(\{1, 2, 3, 4\}\)).
\item \textbf{Supported values}: Values paired with the set of assumptions that
justify them (see \ref{sec:org6c85cbb}).
\item \textbf{TMS entries}: Sets of supported values, representing multiple
contingent beliefs that coexist.
\end{itemize}

Each partial information type defines three generic operations:
\texttt{equivalent?} (test whether two structures represent the same
information), \texttt{merge} (combine two structures), and \texttt{contradictory?}
(test whether a structure represents an impossible state).

The power of the propagator model comes from the ability to define \emph{new}
partial information types. Any data type that forms a join-semilattice
with a bottom element and a contradiction test can be used as cell
content. This extensibility is what allows propagator networks to
operate over types, multiplicities, session protocols, intervals, finite
domains, or any other structured form of partial knowledge.
\subsection{Monotonicity}
\label{sec:orgd4073be}

All information flow in a propagator network must be \textbf{monotonic}: cells
can only gain information, never lose it. In lattice-theoretic terms,
the content of a cell can only move \emph{upward} in the information ordering
(toward more-determined states, further from \(\bot\), closer to \(\top\)).

Monotonicity is the property that makes everything else work:

\begin{itemize}
\item \textbf{Confluence}: Because merge is commutative and associative, and
propagators can only increase cell values, the final result is
independent of execution order.
\item \textbf{Termination}: In a finite lattice, information can only increase a
finite number of times before reaching a fixed point. (Infinite
lattices require \emph{widening} --- see \ref{sec:orgddf2bf4}.)
\item \textbf{Compositionality}: Networks can be freely combined without worrying
about interference. Each sub-network's monotonic contributions compose
with others.
\end{itemize}
