docs/research/PROPAGATOR_NETWORKS.tex
\subsection{Quiescence and Fixed Points}
\label{sec:org9157938}

A propagator network reaches \textbf{quiescence} when no propagator has new
information to contribute --- the system has reached a \textbf{fixed point}.
At quiescence, every cell contains the \textbf{least fixed point} of the system
of equations defined by the propagators: the smallest (least-informative)
cell contents consistent with all propagators being satisfied.

The existence and uniqueness of this least fixed point is guaranteed by
the \textbf{Knaster-Tarski fixed-point theorem}: every monotone function on a
complete lattice has a least fixed point, and it can be computed by
iterating from \(\bot\):

$$\text{lfp}(f) = \bigsqcup_{n \in \mathbb{N}} f^n(\bot)$$

This is precisely what running a propagator network to quiescence
computes: starting from cells containing \(\bot\) (nothing), repeatedly
firing propagators until nothing changes.
\subsection{Multidirectional Computation}
\label{sec:org2691539}

Unlike traditional functions (which map inputs to outputs in one
direction), propagators support \textbf{multidirectional computation}.
A constraint like \(x + y = z\) is expressed not as a function from
\((x, y)\) to \(z\), but as a set of propagators:

\begin{itemize}
\item One computes \(z\) from \(x\) and \(y\)
\item One computes \(x\) from \(z\) and \(y\)
\item One computes \(y\) from \(z\) and \(x\)
\end{itemize}

Given any two of the three values, the third is determined. Given all
three, consistency is verified. This arises naturally from the merge
semantics: each propagator contributes whatever it can, and merge
reconciles all contributions.

The classic example (from Radul and Sussman) is temperature conversion.
The relationship \(C = (F - 32) \times 5/9\) is expressed once, and the
network automatically solves for whichever variable is unknown ---
forward (F to C) or backward (C to F).
\subsection{Supported Values and Dependencies}
\label{sec:org6c85cbb}

A \textbf{supported value} is a pair \((v, P)\) of a datum \(v\) and a set of
\textbf{premises} \(P\) --- the assumptions on which \(v\) depends. This enables
the system to track not just \emph{what} it believes, but \emph{why}.

When a propagator derives new information, the result is tagged with the
union of its inputs' premise sets. If cell \(A\) holds \((3, \{p_1\})\) and
cell \(B\) holds \((5, \{p_2\})\), an addition propagator writes \((8,
\{p_1, p_2\})\) to cell \(C\) --- "the sum is 8, given that we believe both
\(p_1\) and \(p_2\)."

When a contradiction is discovered, the system can identify \emph{which
premises} contributed. The conflicting premise set is recorded as a
\textbf{nogood} --- a set of assumptions that cannot all be simultaneously true.
This enables \textbf{dependency-directed backtracking}: the system retracts the
minimal set of assumptions needed to resolve the conflict, rather than
blindly reverting the most recent choice.
\subsection{Truth Maintenance Integration}
\label{sec:org9c4b2c5}

Propagator networks integrate with \textbf{truth maintenance systems} to enable
hypothetical reasoning. A TMS-backed cell contains a set of supported
values, each contingent on different assumptions. When assumptions are
activated or deactivated, the TMS automatically updates which values are
"in" (currently believed) and which are "out."

The ATMS (Assumption-Based Truth Maintenance System) extends this to
maintain \emph{all possible} worldviews simultaneously. Rather than committing
to one set of assumptions, the ATMS tracks every consistent combination.
This enables:

\begin{itemize}
\item \textbf{Hypothetical reasoning}: "What if we assume \(p_1\)? What follows?"
--- without committing to \(p_1\).
\item \textbf{Dependency-directed backtracking}: When a contradiction is found,
trace back to the responsible premises and record the nogood.
\item \textbf{Non-monotonic reasoning}: While the underlying information flow is
monotonic (lattice joins), the TMS layer enables \emph{belief revision} by
changing which premises are active.
\end{itemize}
\section{Lattice-Theoretic Foundations}
\label{sec:org063aa5a}

\subsection{Lattices and Partial Orders}
\label{sec:org288f4b7}

A \textbf{partial order} is a set \(S\) with a binary relation \(\leq\) that is
reflexive (\(a \leq a\)), antisymmetric (\(a \leq b\) and \(b \leq a\)
implies \(a = b\)), and transitive (\(a \leq b\) and \(b \leq c\) implies \(a
\leq c\)). The ordering represents "has at least as much information as."

A \textbf{join-semilattice} \((L, \leq, \bot, \sqcup)\) is a partial order with:

\begin{itemize}
\item A \textbf{bottom element} \(\bot\) (least informative --- "nothing")
\item A \textbf{join operation} \(\sqcup\) (least upper bound --- "combine
information")
\end{itemize}

The join is commutative, associative, and idempotent. Join is precisely
the merge operation of propagator cells.

A \textbf{complete lattice} additionally has a \textbf{top element} \(\top\) (maximally
informative, representing contradiction) and a \textbf{meet} operation \(\sqcap\)
(greatest lower bound). In propagator networks, reaching \(\top\) signals
that incompatible information has been merged.
\subsection{Merge as Lattice Join}
\label{sec:org3046f89}

The merge operation implements the lattice join:

$$\text{merge}(a, b) = a \sqcup b$$

All algebraic properties of merge follow from the lattice axioms:

\begin{center}
\begin{tabular}{lll}
Property & Equation & Consequence\\
\hline
Commutativity & \(a \sqcup b = b \sqcup a\) & Order-independence\\
Associativity & \((a \sqcup b) \sqcup c = a \sqcup (b \sqcup c)\) & Grouping-independence\\
Idempotency & \(a \sqcup a = a\) & Redundancy-tolerance\\
Identity & \(a \sqcup \bot = a\) & Adding nothing changes nothing\\
Annihilation & \(a \sqcup \top = \top\) & Contradiction is irreversible\\
\end{tabular}
\end{center}
\subsection{Monotone Functions and Convergence}
\label{sec:orgf7abde4}

A function \(f : L \to L\) is \textbf{monotone} if \(a \leq b\) implies \(f(a) \leq
f(b)\) --- more information in, at least as much information out.
Propagators must be monotone functions.

The \textbf{Knaster-Tarski fixed-point theorem} guarantees that every monotone
function on a complete lattice has a least fixed point. Combined with
Kleene's iteration theorem, this means:

\begin{enumerate}
\item A fixed point exists.
\item It can be computed by iterated application from \(\bot\).
\item For finite lattices, iteration terminates in finitely many steps.
\item The result is independent of the iteration order.
\end{enumerate}

Property (4) --- \emph{confluence} --- is the deepest guarantee of the
propagator model: no matter how propagators are scheduled, the network
converges to the same result.
\subsection{The CALM Theorem}
\label{sec:org526044c}

The CALM theorem (Consistency As Logical Monotonicity) \footnote{Hellerstein, J.M. \& Alvaro, P. (2019). "Keeping CALM:
When Distributed Consistency Is Easy." \emph{Communications of the ACM},
63(9).\label{orge067b9c}},
formulated by Hellerstein and Alvaro, establishes that monotonic
programs (those expressible as monotone functions on lattices) can be
executed in a distributed, coordination-free manner while still
producing consistent results. Non-monotonic operations (like negation or
aggregation) require coordination (synchronization barriers).

Propagator networks are inherently monotonic, so the CALM theorem
guarantees that they can be distributed across multiple processors or
machines without coordination, and the result will be the same as
single-machine execution. This makes propagator networks a natural fit
for parallel and distributed computation.
\subsection{Widening and Narrowing}
\label{sec:orgddf2bf4}

For lattices of infinite height (e.g., the lattice of integer intervals
\([lo, hi]\)), Kleene iteration may not terminate --- a cell could ascend
through infinitely many refinements. \textbf{Widening} (due to Cousot \& Cousot
