docs/research/PROPAGATOR_NETWORKS.tex
\section{Applications}
\label{sec:orga9bab48}

\subsection{Type Inference}
\label{sec:orgc741aaf}

Type inference --- the problem of determining the types of expressions
in a program without explicit annotations --- maps directly onto
propagator networks. Radul's thesis includes a chapter titled "Type
Inference Looks Like Propagation Too."

The mapping:

\begin{itemize}
\item Each type variable (metavariable) is a \emph{cell}, initially containing
\(\bot\) ("I don't yet know what type this is").
\item Each typing rule (function application, variable binding, etc.) is a
\emph{propagator} that constrains related type cells.
\item Unification is \emph{merge}: when two type cells are constrained to be
equal, their contents are merged (unified). Compatible types merge to
a more-specific type; incompatible types merge to \(\top\)
(type error).
\item Running to quiescence computes the principal type (the most general
type consistent with all constraints).
\end{itemize}

Bidirectional type checking --- splitting inference into synthesis
(bottom-up, from term to type) and checking (top-down, from expected
type to term) --- is a natural instance of multidirectional propagation.
Recent work by Leijen \footnote{Leijen, D. (2025). "Omnidirectional Type Inference
for ML."} on "omnidirectional type
inference" makes this explicit: typing constraints suspend when
information is insufficient and resume when other constraints supply it
--- precisely propagator semantics.
\subsection{Constraint Solving}
\label{sec:org41de211}

Propagator networks are the native architecture of constraint solving.
Variables are cells, constraints are propagators, and solving is running
to quiescence. The advantages over traditional constraint solvers:

\begin{itemize}
\item \textbf{Mixed-domain solving}: Finite domain constraints, interval
constraints, type constraints, and user-defined constraints can
coexist in a single network, connected by cross-domain propagators.
\item \textbf{Persistent backtracking}: If the network uses persistent (immutable)
data structures, backtracking is \(O(1)\) --- just keep the old network
reference. Traditional CP systems pay \(O(\text{trail length})\) per
backtrack.
\item \textbf{Extensibility}: Adding a new constraint domain is defining a new
lattice and wiring propagators. In traditional systems (Gecode,
MiniZinc), adding a domain requires low-level implementation.
\end{itemize}
\subsection{Abstract Interpretation}
\label{sec:org9053461}

Abstract interpretation \footnote{Cousot, P. \& Cousot, R. (1977). "Abstract
Interpretation: A Unified Lattice Model for Static Analysis of Programs
by Construction or Approximation of Fixpoints." \emph{POPL 1977}.} --- computing sound
approximations of program behavior over abstract domains --- is
propagator networks operating over abstract lattices:

\begin{itemize}
\item Each \emph{program point} is a cell holding an abstract value (e.g., sign,
interval, pointer alias set).
\item Each \emph{program statement} is a propagator computing abstract transfer
functions.
\item Running to quiescence computes the analysis fixed point.
\item Widening handles infinite-height abstract domains.
\end{itemize}

The connection to propagators is made precise by \textbf{Galois connections}:
pairs of monotone functions \((\alpha : C \to A, \gamma : A \to C)\)
connecting concrete and abstract domains. Cross-domain propagators use
Galois connections to flow information between multiple abstract domains
simultaneously --- the "reduced product" of multiple analyses becomes
automatic when all domains share a propagator network.
\subsection{Protocol Verification via Session Types}
\label{sec:orgabb0b61}

Session types --- type-theoretic specifications of communication
protocols --- can be verified using propagator networks. Each channel
endpoint is a cell in a session type lattice; each communication
operation (send, receive, select, offer) is a propagator that constrains
the channel's protocol.

Caires and Pfenning \footnote{Caires, L. \& Pfenning, F. (2010). "Session Types
as Intuitionistic Linear Propositions." \emph{CONCUR 2010}.} established a Curry-Howard
correspondence between session types and intuitionistic linear logic.
Propagator-based session type checking exploits this: the duality
constraint (client and server must follow dual protocols) is a
bidirectional propagator, and protocol violations are contradictions
(lattice top) with dependency chains explaining \emph{which} communication
step violated \emph{which} protocol clause.
\subsection{Incremental Compilation}
\label{sec:orgc79f174}

An incremental compiler can be structured as a propagator network:

\begin{itemize}
\item Source files are cells (content = parsed AST).
\item Compilation phases (parse → elaborate → type-check → codegen) are
propagator chains.
\item A file change updates a cell; running to quiescence recomputes only
affected downstream cells.
\item Persistent networks give \(O(1)\) access to the previous version for
delta computation.
\end{itemize}

The multidirectionality of propagators adds a novel capability: a type
signature change can propagate \emph{backward} to callers, enabling "what-if"
analysis ("what happens if I change this type?") without recompiling.
This connects to Acar's work on self-adjusting computation
\subsection{Diagnostic Reasoning}
\label{sec:orgddc88f8}

De Kleer and Williams's General Diagnostic Engine (GDE, 1987)
\section{Implementations}
\label{sec:orgf1dc383}

\subsection{The Reference Implementation (Scheme)}
\label{sec:org7769237}

The canonical implementation is Radul and Sussman's Scheme-Propagators
\subsection{Haskell Libraries}
\label{sec:org9ae21d5}

\textbf{Edward Kmett's \texttt{propagators}} \footnote{Kmett, E. Haskell \texttt{propagators} library.
\url{https://github.com/ekmett/propagators}}: An exploration
of propagator design in Haskell. The primary innovation beyond the
published Scheme work is the use of \textbf{observable sharing} to let users
write in a direct programming style that is automatically transformed
to and from propagator form.

\textbf{Holmes} \footnote{Holmes (i-am-tom). Haskell constraint-solving with
propagators and CDCL. \url{https://github.com/i-am-tom/holmes}}: A reference library for constraint-solving with
propagators and CDCL. Holmes exposes two strategies: \texttt{satisfying}
(returns first valid configuration) and \texttt{whenever} (returns all valid
configurations). Its README demonstrates a complete Sudoku solver.
\subsection{Clojure Libraries}
\label{sec:org62e9c38}

\textbf{propaganda} \footnote{Nilsson, T.K. \texttt{propaganda} --- Clojure propagator
library. \url{https://github.com/tgk/propaganda}}: A Clojure propagator library implementing
the model from "The Art of the Propagator." Offers both an STM-based
and an immutable implementation strategy.
\subsection{Constraint Programming Systems}
\label{sec:orgcef0018}

\textbf{Gecode} \textsuperscript{\ref{org4786136}}: A production-quality, highly efficient constraint
solver explicitly built on a propagator architecture. Gecode
demonstrates that the propagator architecture is viable for
industrial-strength constraint solving. Its propagation kernel is
domain-independent, and propagators are first-class objects that can be
dynamically added to a constraint model.

Most modern CP systems (SICStus Prolog, ECLiPSe, SWI-Prolog's CLP
libraries) use propagator-based architectures internally, where each
constraint is a propagator that narrows variable domains.
\section{A Worked Example: The Prologos Propagator Architecture}
\label{prologos}
To illustrate how propagator networks function as practical
infrastructure, we describe the propagator architecture of Prologos ---
a programming language that uses propagator networks as the unified
substrate for type inference, multiplicity tracking (QTT), and session
type verification.
