docs/research/PROPAGATOR_NETWORKS.org
** Design Principles

Prologos's propagator network is built on three architectural principles:

1. *Persistent/immutable data structures*: The entire network is a pure,
   immutable value. Each operation (cell creation, propagator addition,
   cell write) returns a /new/ network, leaving the old one unchanged.
   This enables $O(1)$ backtracking (keep the old reference) and safe
   parallel exploration (fork the network value).

2. *Three-domain unification*: Type inference, QTT multiplicity
   tracking, and session type verification all operate on the same
   propagator network. Each domain defines its own lattice and
   propagators; cross-domain /Galois connection/ propagators bridge them.

3. *Trait-based extensibility*: Lattice behavior (bottom, join,
   contradiction detection) is defined via a =Lattice= trait.
   New domains can be added at the library level by implementing
   the trait, without modifying the propagator infrastructure.

** Core Data Structures

The network is built on CHAMP (Compressed Hash Array Mapped Prefix-tree)
persistent hash maps, giving $O(\log_{32} N)$ lookup, insert, and delete
with structural sharing.

#+begin_src
struct cell-id(n : Nat)          ;; unique cell identifier
struct prop-id(n : Nat)          ;; unique propagator identifier

struct prop-cell
  value      : Lattice           ;; current lattice element (starts at ⊥)
  dependents : CHAMP(prop-id)    ;; propagators to fire on change

struct propagator
  inputs  : List(cell-id)        ;; cells this reads from
  outputs : List(cell-id)        ;; cells this may write to
  fire-fn : Network → Network    ;; pure state transformer

struct prop-network
  cells         : CHAMP(cell-id → prop-cell)
  propagators   : CHAMP(prop-id → propagator)
  worklist      : List(prop-id)  ;; propagators waiting to fire
  fuel          : Nat            ;; step limit to prevent runaway
  contradiction : cell-id | #f   ;; first cell that reached ⊤
  merge-fns     : CHAMP(cell-id → (a b → merged))
  ...                            ;; + contradiction-fns, widen-fns,
                                 ;;   decomposition registries
#+end_src

** The Three Lattice Domains

*** Type Lattice

#+begin_src
  type-bot (⊥, no information — fresh metavariable)
      ↓
  T (concrete type expression)
      ↓
  type-top (⊤, contradiction — incompatible types)
#+end_src

The merge function attempts /pure/ unification (side-effect free) of
two type expressions. If unification succeeds, the result is the unified
type. If it fails, the result is $\top$ (type error).

A critical design choice: the type lattice's merge function uses only
/read-only callbacks/ to resolve metavariables, breaking the circular
dependency between the metavar store (which uses the network) and the
type lattice (which the network uses).

*** Multiplicity Lattice

#+begin_src
  mult-bot (⊥, no information)
      ↓
  m0 / m1 / mw (erased, linear, unrestricted — mutually incomparable)
      ↓
  mult-top (⊤, contradiction)
#+end_src

This is a flat lattice: $\bot \sqcup x = x$, $x \sqcup x = x$, $x
\sqcup y = \top$ for $x \neq y$. Multiplicities track how many times a
value is used, supporting Quantitative Type Theory (QTT).

*** Session Lattice

#+begin_src
  sess-bot (⊥, no information)
      ↓
  Send(A, S) / Recv(A, S) / Choice{...} / Offer{...} / End / ...
      ↓
  sess-top (⊤, protocol violation)
#+end_src

Session types describe communication protocols. Merge performs structural
unification: same-polarity sessions (send + send) merge component types
and continuations; different-polarity sessions (send + recv) produce
$\top$ (protocol violation). Choice labels merge covariantly (intersection);
offer labels merge contravariantly (union).

** Cross-Domain Propagation via Galois Connections

Different lattice domains are connected by *Galois connection
propagators* --- pairs of monotone functions $(\alpha, \gamma)$ that
bridge information between domains:

#+begin_src
;; Type → Multiplicity bridge:
;;   α extracts multiplicity info from type structure
;;   γ returns ⊥ (types don't learn from multiplicities)

;; Session → Type bridge:
;;   α extracts message type from session step
;;   γ returns ⊥ (sessions don't learn from types)
#+end_src

Each Galois connection creates two unidirectional propagators (one per
direction). The $\alpha$ direction (concrete → abstract) extracts
information; the $\gamma$ direction typically returns $\bot$ (the
abstract domain doesn't constrain the concrete domain). More
sophisticated connections can propagate information in both directions.

** Scheduling Strategies

*** Gauss-Seidel (Sequential)

The default scheduler processes one propagator at a time:

#+begin_src
while worklist ≠ empty:
  pop propagator p from worklist
  apply fire-fn(p) to network, producing network'
  if any output cell changed: enqueue dependent propagators
  decrement fuel
#+end_src

This is the simplest and typically fastest strategy for single-threaded
execution.

*** BSP (Parallel)

The Bulk Synchronous Parallel scheduler processes all worklist entries in
parallel against a frozen snapshot, then bulk-merges results:

#+begin_src
while worklist ≠ empty:
  Round k:
    fire ALL propagators in worklist (in parallel, against snapshot)
    bulk-merge all cell changes
    enqueue affected propagators for next round
#+end_src

By the CALM theorem, both strategies converge to the same fixed point.
The BSP strategy can leverage multiple cores but may require more rounds
(Jacobi iteration converges more slowly than Gauss-Seidel for chain
topologies).

** Structural Decomposition

When the network unifies two compound types (e.g., $\text{Pi}(A_1,
B_1)$ with $\text{Pi}(A_2, B_2)$), the unification propagator creates
/sub-cells/ for the components ($A_1$ vs $A_2$, $B_1$ vs $B_2$) and
registers new sub-propagators to unify them. A deduplication registry
prevents the same compound pair from being decomposed twice.

This on-demand structural decomposition is key to handling recursive and
compound types efficiently: cells and propagators are created only as
needed, keeping the network sparse.

** Example: Type Inference as Propagation

Consider type-checking the expression ~f x~ where ~f : Int -> Bool~ and
~x : Int~:

1. Create cells: $c_f$ (type of ~f~), $c_x$ (type of ~x~), $c_r$
   (type of result).
2. Write known types: $c_f \leftarrow \text{Int} \to \text{Bool}$, $c_x
   \leftarrow \text{Int}$.
3. Add application propagator: "if $c_f = A \to B$ and $c_x$ is
   compatible with $A$, then $c_r \leftarrow B$."
4. Propagator fires: $c_f$ is $\text{Int} \to \text{Bool}$, $c_x$ is
   $\text{Int}$. Merge $c_x$ with domain type $A = \text{Int}$:
   consistent. Write $c_r \leftarrow \text{Bool}$.
5. Quiescence: all cells stable. Result type is $\text{Bool}$.

If ~x~ had been ~"hello"~ (type $\text{String}$), step 4 would merge
$\text{String}$ with $\text{Int}$, producing $\top$ (type error) ---
with a dependency chain explaining that the error arose from the
application of ~f~ to ~x~.

