docs/research/PROPAGATOR_NETWORKS.tex
\subsection{Propagators as Universal Substrate}
\label{sec:org1cb94ce}

The deepest validation of this architecture is that \emph{the same
infrastructure serves all three domains without modification}. The
propagator network does not know or care whether a cell holds a type, a
multiplicity, or a session protocol. It only knows that cells have merge
functions, propagators have fire functions, and the network runs to
quiescence.

This means that the three domains compose for free: type inference,
multiplicity tracking, and session type verification run simultaneously
on the same network, with Galois connections bridging information
between them. A type error can surface from a session type constraint;
a multiplicity violation can arise from a type structure. The
propagator network routes information to wherever it is needed,
automatically.
\section{Future Directions}
\label{sec:org56f8ccf}

\subsection{Theorem Proving via Abstract CDCL}
\label{sec:org822417e}

D'Silva et al. \textsuperscript{\ref{org393d4e3}} showed that CDCL generalizes from Booleans to
arbitrary lattices. Combined with an ATMS, this yields a
propagator-native theorem prover: cells hold lattice values, propagators
encode inference rules, ATMS manages hypothetical reasoning and conflict
analysis. This could enable type-level theorem proving and automated
capability verification without an external SMT solver.
\subsection{User-Defined Constraint Domains}
\label{sec:org512d634}

Because lattice behavior is defined by a trait, users of a
propagator-based language can define their own constraint domains
entirely at the library level. A string-length-bound lattice, a
nullability lattice, or a permission lattice can be defined, populated
with propagators, and connected to the type system via Galois
connections --- all without modifying the core infrastructure.
\subsection{Distributed Propagation}
\label{sec:org0557a49}

Since propagator cells satisfy CRDT merge requirements, a propagator
network can be partitioned across nodes. Boundary cells are replicated
and synchronized via lattice merge. Message ordering is irrelevant
(commutativity), and convergence is guaranteed (CALM theorem). This
enables distributed type checking, multi-agent constraint solving, and
decentralized belief propagation.
\subsection{Incremental and Live Programming}
\label{sec:orgbb8c7c4}

Persistent propagator networks enable "what-if" exploration: fork the
network, make a hypothetical change, observe consequences, and discard
the fork at zero cost. Combined with IDE integration, this enables live
type checking where edits propagate incrementally to diagnostics,
completions, and refactoring suggestions.
\subsection{Provenance and Explainability}
\label{sec:org8e2e4d0}

ATMS dependency chains provide causal explanations for every derived
value. Combined with provenance semirings \footnote{Green, T.J., Karvounarakis, G., \& Tannen, V.
(2007). "Provenance Semirings." \emph{PODS 2007}.},
this enables rich answers to questions like "why does this cell have
this type?" "what assumptions contributed?" and "what is the minimal
change to resolve this error?" --- transforming compiler diagnostics
from symptoms to explanations.
\section{References}
\label{sec:org91a08b8}
\end{document}
